hw-5-mvc/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @comment = Comment.find(params[:id])

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "add a comment logic 1"], ["updated_at", "2025-01-09 22:56:00.926353"], ["id", 1]]
---
  def update
    if @comment.update(comment_params)

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @tweet = Tweet.find(params[:tweet_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @tweet = @comment.tweet # Знаходимо твіт, щоб повернутися на ту ж сторінку
    @comment.destroy

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test comment"], ["tweet_id", 2], ["user_id", 2], ["created_at", "2025-01-10 00:07:53.131082"], ["updated_at", "2025-01-10 00:07:53.131082"]]
---
  def create
    @tweet = Tweet.find(params[:tweet_id])
    @comment = @tweet.comments.new(comment_params.merge(user: current_user))

    if @comment.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tweet
    @tweet = Tweet.find(params[:tweet_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def authorize_user
    @comment = Comment.find(params[:id])