hw-5-mvc/app/controllers/comments_controller.rb

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 10]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @tweet = @comment.tweet # Знаходимо твіт, щоб повернутися на ту ж сторінку
    @comment.destroy

INSERT INTO "comments" ("content", "tweet_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["tweet_id", 1], ["user_id", 1], ["created_at", "2025-01-08 23:37:49.343187"], ["updated_at", "2025-01-08 23:37:49.343187"]]
---
  def create
    @tweet = Tweet.find(params[:tweet_id])
    @comment = @tweet.comments.new(comment_params.merge(user: current_user))

    if @comment.save