hw-5-mvc/app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["tweet_id", 1], ["created_at", "2025-01-09 23:44:41.999033"], ["updated_at", "2025-01-09 23:44:41.999033"]]
---
  def create
    like = current_user.likes.new(tweet: @tweet)

    if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 1], ["tweet_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    like = current_user.likes.find_by(tweet: @tweet)

    if like&.destroy

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tweet
    @tweet = Tweet.find(params[:tweet_id])