hw-5-mvc/app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "i added likes"], ["user_id", 2], ["created_at", "2025-01-10 00:06:55.622100"], ["updated_at", "2025-01-10 00:06:55.622100"]]