hw-5-mvc/app/controllers/tweets_controller.rb

  def show
    @tweet = Tweet.find_by(id: params[:id])
    if @tweet
      render inline: <<-ERB
        <h1><%= @tweet.content %></h1>
        <p>Posted by: <%= @tweet.user.user_profile.first_name %> <%= @tweet.user.user_profile.last_name %> (@<%= @tweet.user.user_profile.username %>)</p>
        <h2>Comments</h2>
        <% if @tweet.comments.any? %>
          <% @tweet.comments.each do |comment| %>
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."tweet_id" = ? LIMIT ?  [["tweet_id", 1], ["LIMIT", 1]]

  def create
    @tweet = Tweet.new(tweet_params)

    if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "i need to fix some bugs"], ["user_id", 1], ["created_at", "2025-01-08 20:42:32.937739"], ["updated_at", "2025-01-08 20:42:32.937739"]]