hw-5-mvc/app/views/tweets/_show.html.erb

SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  <strong>
    <%= tweet.user.user_profile.first_name %> <%= tweet.user.user_profile.last_name %>