hw-5-mvc/app/views/tweets/_tweet_preview.html.erb

      <strong>
        <%= tweet.user.user_profile.first_name %> <%= tweet.user.user_profile.last_name %>
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    <div id="comments">
      <% if tweet.comments.any? %>
        <% tweet.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 1]]
SELECT 1 AS one FROM "comments" WHERE "comments"."tweet_id" = ? LIMIT ?  [["tweet_id", 1], ["LIMIT", 1]]