hw-5-mvc/app/views/likes/_like.html.erb

<div class="tweet-actions">
  <p>Likes: <%= tweet.likes.count %></p>
  <% if current_user.liked_tweets.include?(tweet) %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 1]]
SELECT 1 AS one FROM "tweets" INNER JOIN "likes" ON "tweets"."id" = "likes"."tweet_id" WHERE "likes"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]